<?xml version="1.0" ?>
<net name="mosaic_pop_1e3" version="10">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="1, 3, 1080, 1080" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="input.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="433" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="43312094" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_7" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="4" name="Pad_13" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="85">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1088</dim>
					<dim>1088</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1.conv2d.weight" type="Const" version="opset1">
			<data element_type="f16" shape="8, 3, 9, 9" offset="34" size="3888"/>
			<output>
				<port id="0" precision="FP16" names="conv1.conv2d.weight">
					<dim>8</dim>
					<dim>3</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv_14/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1088</dim>
					<dim>1088</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>3</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_14/Dims3411" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8, 1, 1" offset="3922" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_14" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="86">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="InstanceNormalization_15/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3938" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="10" name="InstanceNormalization_15/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="InstanceNormalization_15/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="InstanceNormalization_15/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3946" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="InstanceNormalization_15/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="14" name="InstanceNormalization_15/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3954" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="15" name="InstanceNormalization_15/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="InstanceNormalization_15/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="in1.weight" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8, 1, 1" offset="3962" size="16"/>
			<output>
				<port id="0" precision="FP16" names="in1.weight">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="InstanceNormalization_15/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="in1.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8, 1, 1" offset="3978" size="16"/>
			<output>
				<port id="0" precision="FP16" names="in1.bias">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="InstanceNormalization_15" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="87">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Relu_16" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="88">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="39712220" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="397" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_50" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="25" name="Pad_30" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1080</dim>
					<dim>1080</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="111">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1082</dim>
					<dim>1082</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv2.conv2d.weight" type="Const" version="opset1">
			<data element_type="f16" shape="16, 8, 3, 3" offset="4026" size="2304"/>
			<output>
				<port id="0" precision="FP16" names="conv2.conv2d.weight">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_31/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1082</dim>
					<dim>1082</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>540</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_31/Dims3357" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="6330" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_31" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>540</dim>
					<dim>540</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="112">
					<dim>1</dim>
					<dim>16</dim>
					<dim>540</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="InstanceNormalization_32/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3938" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="31" name="InstanceNormalization_32/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>540</dim>
					<dim>540</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="InstanceNormalization_32/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="InstanceNormalization_32/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3946" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="InstanceNormalization_32/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="35" name="InstanceNormalization_32/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3954" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="36" name="InstanceNormalization_32/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="InstanceNormalization_32/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>540</dim>
					<dim>540</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>540</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="in2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="6362" size="32"/>
			<output>
				<port id="0" precision="FP16" names="in2.weight">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="InstanceNormalization_32/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>540</dim>
					<dim>540</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>540</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="in2.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="6394" size="32"/>
			<output>
				<port id="0" precision="FP16" names="in2.bias">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="InstanceNormalization_32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>540</dim>
					<dim>540</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="113">
					<dim>1</dim>
					<dim>16</dim>
					<dim>540</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Relu_33" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>540</dim>
					<dim>540</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="114">
					<dim>1</dim>
					<dim>16</dim>
					<dim>540</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="412" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="41212145" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_93" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="46" name="Pad_47" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>540</dim>
					<dim>540</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="137">
					<dim>1</dim>
					<dim>16</dim>
					<dim>542</dim>
					<dim>542</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="conv3.conv2d.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 3, 3" offset="6426" size="9216"/>
			<output>
				<port id="0" precision="FP16" names="conv3.conv2d.weight">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_48/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>542</dim>
					<dim>542</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_48/Dims3339" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="15642" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_48" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="138">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="InstanceNormalization_49/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3938" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="52" name="InstanceNormalization_49/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="InstanceNormalization_49/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="InstanceNormalization_49/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3946" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="InstanceNormalization_49/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="56" name="InstanceNormalization_49/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3954" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="57" name="InstanceNormalization_49/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="InstanceNormalization_49/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="in3.weight" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="15706" size="64"/>
			<output>
				<port id="0" precision="FP16" names="in3.weight">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="InstanceNormalization_49/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="in3.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="15770" size="64"/>
			<output>
				<port id="0" precision="FP16" names="in3.bias">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="InstanceNormalization_49" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="139">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Relu_50" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="140">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="43012136" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="430" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_136" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="67" name="Pad_64" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="163">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="res1.conv1.conv2d.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="15834" size="18432"/>
			<output>
				<port id="0" precision="FP16" names="res1.conv1.conv2d.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_65/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>272</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_65/Dims3363" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="34266" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_65" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="164">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="InstanceNormalization_66/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3938" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="73" name="InstanceNormalization_66/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="InstanceNormalization_66/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="InstanceNormalization_66/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3946" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="InstanceNormalization_66/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="77" name="InstanceNormalization_66/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3954" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="78" name="InstanceNormalization_66/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="InstanceNormalization_66/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="res1.in1.weight" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="34330" size="64"/>
			<output>
				<port id="0" precision="FP16" names="res1.in1.weight">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="InstanceNormalization_66/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="res1.in1.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="34394" size="64"/>
			<output>
				<port id="0" precision="FP16" names="res1.in1.bias">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="InstanceNormalization_66" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="165">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Relu_67" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="166">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="394" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="39411857" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_179" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="88" name="Pad_81" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="189">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="res1.conv2.conv2d.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="34458" size="18432"/>
			<output>
				<port id="0" precision="FP16" names="res1.conv2.conv2d.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_82/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>272</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_82/Dims3345" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="52890" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_82" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="190">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="InstanceNormalization_83/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3938" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="94" name="InstanceNormalization_83/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="InstanceNormalization_83/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="InstanceNormalization_83/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3946" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="InstanceNormalization_83/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="98" name="InstanceNormalization_83/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3954" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="99" name="InstanceNormalization_83/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="InstanceNormalization_83/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="res1.in2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="52954" size="64"/>
			<output>
				<port id="0" precision="FP16" names="res1.in2.weight">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="InstanceNormalization_83/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="res1.in2.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="53018" size="64"/>
			<output>
				<port id="0" precision="FP16" names="res1.in2.bias">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="InstanceNormalization_83" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="191">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Add_84" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="192">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="406" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="40611941" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_222" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="109" name="Pad_98" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="215">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="res2.conv1.conv2d.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="53082" size="18432"/>
			<output>
				<port id="0" precision="FP16" names="res2.conv1.conv2d.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_99/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>272</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_99/Dims3381" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="71514" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_99" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="216">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="InstanceNormalization_100/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3938" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="115" name="InstanceNormalization_100/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="InstanceNormalization_100/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="InstanceNormalization_100/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3946" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="InstanceNormalization_100/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="119" name="InstanceNormalization_100/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3954" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="120" name="InstanceNormalization_100/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="InstanceNormalization_100/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="res2.in1.weight" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="71578" size="64"/>
			<output>
				<port id="0" precision="FP16" names="res2.in1.weight">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="InstanceNormalization_100/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="res2.in1.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="71642" size="64"/>
			<output>
				<port id="0" precision="FP16" names="res2.in1.bias">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="InstanceNormalization_100" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="217">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Relu_101" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="218">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="43612160" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="436" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Constant_265" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="130" name="Pad_115" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="241">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="res2.conv2.conv2d.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="71706" size="18432"/>
			<output>
				<port id="0" precision="FP16" names="res2.conv2.conv2d.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Conv_116/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>272</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Conv_116/Dims3351" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="90138" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Conv_116" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>270</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
