<?xml version="1.0" ?>
<net name="mosaic_opt_flow_grad_clip_1" version="10">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="1, 3, 960, 540" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="input.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="354" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="355" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_7" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="4" name="Pad_0" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="63">
					<dim>1</dim>
					<dim>3</dim>
					<dim>968</dim>
					<dim>548</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1.1.weight" type="Const" version="opset1">
			<data element_type="f16" shape="8, 3, 9, 9" offset="34" size="3888"/>
			<output>
				<port id="0" precision="FP16" names="conv1.1.weight">
					<dim>8</dim>
					<dim>3</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv_1/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>968</dim>
					<dim>548</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>3</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_1/Dims2955" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8, 1, 1" offset="3922" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="64">
					<dim>1</dim>
					<dim>8</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="InstanceNormalization_2/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3938" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="10" name="InstanceNormalization_2/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="InstanceNormalization_2/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="InstanceNormalization_2/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3946" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="InstanceNormalization_2/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="14" name="InstanceNormalization_2/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3954" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="15" name="InstanceNormalization_2/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="InstanceNormalization_2/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="conv1.2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8, 1, 1" offset="3962" size="16"/>
			<output>
				<port id="0" precision="FP16" names="conv1.2.weight">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="InstanceNormalization_2/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="conv1.2.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8, 1, 1" offset="3978" size="16"/>
			<output>
				<port id="0" precision="FP16" names="conv1.2.bias">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="InstanceNormalization_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="65">
					<dim>1</dim>
					<dim>8</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Relu_3" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="66">
					<dim>1</dim>
					<dim>8</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="357" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="358" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_50" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="25" name="Pad_4" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>960</dim>
					<dim>540</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="67">
					<dim>1</dim>
					<dim>8</dim>
					<dim>962</dim>
					<dim>542</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv2.1.weight" type="Const" version="opset1">
			<data element_type="f16" shape="16, 8, 3, 3" offset="4026" size="2304"/>
			<output>
				<port id="0" precision="FP16" names="conv2.1.weight">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_5/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>962</dim>
					<dim>542</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_5/Dims3015" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="6330" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_5" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="68">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="InstanceNormalization_6/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3938" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="31" name="InstanceNormalization_6/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>270</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="InstanceNormalization_6/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="InstanceNormalization_6/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3946" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="InstanceNormalization_6/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="35" name="InstanceNormalization_6/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3954" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="36" name="InstanceNormalization_6/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="InstanceNormalization_6/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="conv2.2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="6362" size="32"/>
			<output>
				<port id="0" precision="FP16" names="conv2.2.weight">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="InstanceNormalization_6/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv2.2.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="6394" size="32"/>
			<output>
				<port id="0" precision="FP16" names="conv2.2.bias">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="InstanceNormalization_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="69">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Relu_7" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>270</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="70">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>270</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="360" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="361" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_93" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="46" name="Pad_8" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>270</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="71">
					<dim>1</dim>
					<dim>16</dim>
					<dim>482</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="conv3.1.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 3, 3" offset="6426" size="9216"/>
			<output>
				<port id="0" precision="FP16" names="conv3.1.weight">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_9/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>482</dim>
					<dim>272</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_9/Dims2961" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="15642" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="72">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="InstanceNormalization_10/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3938" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="52" name="InstanceNormalization_10/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="InstanceNormalization_10/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="InstanceNormalization_10/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3946" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="InstanceNormalization_10/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="56" name="InstanceNormalization_10/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3954" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="57" name="InstanceNormalization_10/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="InstanceNormalization_10/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="conv3.2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="15706" size="64"/>
			<output>
				<port id="0" precision="FP16" names="conv3.2.weight">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="InstanceNormalization_10/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="conv3.2.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="15770" size="64"/>
			<output>
				<port id="0" precision="FP16" names="conv3.2.bias">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="InstanceNormalization_10" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="73">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Relu_11" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="74">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="363" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="364" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_136" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="67" name="Pad_12" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="75">
					<dim>1</dim>
					<dim>32</dim>
					<dim>242</dim>
					<dim>137</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="res1.conv1.1.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="15834" size="18432"/>
			<output>
				<port id="0" precision="FP16" names="res1.conv1.1.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_13/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>242</dim>
					<dim>137</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_13/Dims3009" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="34266" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_13" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="76">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="InstanceNormalization_14/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3938" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="73" name="InstanceNormalization_14/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="InstanceNormalization_14/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="InstanceNormalization_14/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3946" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="InstanceNormalization_14/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="77" name="InstanceNormalization_14/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3954" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="78" name="InstanceNormalization_14/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="InstanceNormalization_14/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="res1.conv1.2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="34330" size="64"/>
			<output>
				<port id="0" precision="FP16" names="res1.conv1.2.weight">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="InstanceNormalization_14/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="res1.conv1.2.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="34394" size="64"/>
			<output>
				<port id="0" precision="FP16" names="res1.conv1.2.bias">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="InstanceNormalization_14" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="77">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Relu_15" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="78">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="366" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="367" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_179" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="88" name="Pad_16" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="79">
					<dim>1</dim>
					<dim>32</dim>
					<dim>242</dim>
					<dim>137</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="res1.conv2.1.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="34458" size="18432"/>
			<output>
				<port id="0" precision="FP16" names="res1.conv2.1.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_17/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>242</dim>
					<dim>137</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_17/Dims2997" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="52890" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_17" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="80">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="InstanceNormalization_18/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3938" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="94" name="InstanceNormalization_18/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="InstanceNormalization_18/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="InstanceNormalization_18/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3946" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="InstanceNormalization_18/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="98" name="InstanceNormalization_18/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3954" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="99" name="InstanceNormalization_18/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="InstanceNormalization_18/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="res1.conv2.2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="52954" size="64"/>
			<output>
				<port id="0" precision="FP16" names="res1.conv2.2.weight">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="InstanceNormalization_18/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="res1.conv2.2.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="53018" size="64"/>
			<output>
				<port id="0" precision="FP16" names="res1.conv2.2.bias">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="InstanceNormalization_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="81">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Relu_19" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="82">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Add_20" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="83">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="369" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="370" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_224" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="110" name="Pad_21" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="84">
					<dim>1</dim>
					<dim>32</dim>
					<dim>242</dim>
					<dim>137</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="res2.conv1.1.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="53082" size="18432"/>
			<output>
				<port id="0" precision="FP16" names="res2.conv1.1.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_22/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>242</dim>
					<dim>137</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_22/Dims2949" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="71514" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="85">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="InstanceNormalization_23/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3938" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="116" name="InstanceNormalization_23/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="InstanceNormalization_23/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="InstanceNormalization_23/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3946" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="InstanceNormalization_23/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="120" name="InstanceNormalization_23/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3954" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="121" name="InstanceNormalization_23/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="InstanceNormalization_23/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="res2.conv1.2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="71578" size="64"/>
			<output>
				<port id="0" precision="FP16" names="res2.conv1.2.weight">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="InstanceNormalization_23/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="res2.conv1.2.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="71642" size="64"/>
			<output>
				<port id="0" precision="FP16" names="res2.conv1.2.bias">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="InstanceNormalization_23" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="86">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Relu_24" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="87">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="372" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="373" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3994" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Constant_267" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="131" name="Pad_25" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="88">
					<dim>1</dim>
					<dim>32</dim>
					<dim>242</dim>
					<dim>137</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="res2.conv2.1.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="71706" size="18432"/>
			<output>
				<port id="0" precision="FP16" names="res2.conv2.1.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Conv_26/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>242</dim>
					<dim>137</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>135</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Conv_26/Dims2985" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="90138" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Conv_26" type="Add" version="opset1">
